БухЭксп/Catalogs/CW_ПрофилиДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПрофилиДоступа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектДоступа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ОбъектыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДоступа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ТипыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектДоступа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ОбъектыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДоступа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ТипыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ОбъектыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ОбъектыДоступа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник_Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник_ВерсииБюджетов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ТипыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ТипыДоступа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Все</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеКроме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоВыбранные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПрофилиДоступа/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьПрофильДоступаНаСервере(Отказ) Экспорт
	
	Попытка
		СпрОбъект = Справочники.CW_ПрофилиДоступа.ПоУмолчанию.ПолучитьОбъект();
		
		СпрОбъект.ОбъектыДоступа.Очистить();
		СпрОбъект.ЗначенияДоступа.Очистить();
		
		//Добавляем объект доступа
		СтрокаОбъектыДоступа				= СпрОбъект.ОбъектыДоступа.Добавить();
		СтрокаОбъектыДоступа.ОбъектДоступа  = Перечисления.CW_ОбъектыДоступа.Справочник_Контрагенты;
		СтрокаОбъектыДоступа.ТипДоступа 	= Перечисления.CW_ТипыДоступа.Все;
		
		СтрокаОбъектыДоступа				= СпрОбъект.ОбъектыДоступа.Добавить();
		СтрокаОбъектыДоступа.ОбъектДоступа  = Перечисления.CW_ОбъектыДоступа.Справочник_ВерсииБюджетов;
		СтрокаОбъектыДоступа.ТипДоступа 	= Перечисления.CW_ТипыДоступа.Все;
		
		СпрОбъект.Записать();
	Исключение
		Отказ = истина;
	КонецПопытки;
	
КонецПроцедуры

#КонецЕсли
